[{"id":"_wr0fmgjnh","title":"Routing | Node.js","type":"technology","author":"Gil Pereira","text":"Routing refers to how an application’s endpoints (URIs) respond to client requests. For an introduction to routing, see Basic routing.\r\n\r\nYou define routing using methods of the Express app object that correspond to HTTP methods; for example, app.get() to handle GET requests and app.post to handle POST requests. For a full list, see app.METHOD. You can also use app.all() to handle all HTTP methods and app.use() to specify middleware as the callback function (See Using middleware for details).\r\n\r\nThese routing methods specify a callback function (sometimes called “handler functions”) called when the application receives a request to the specified route (endpoint) and HTTP method. In other words, the application “listens” for requests that match the specified route(s) and method(s), and when it detects a match, it calls the specified callback function.\r\n\r\nIn fact, the routing methods can have more than one callback function as arguments. With multiple callback functions, it is important to provide next as an argument to the callback function and then call next() within the body of the function to hand off control to the next callback operation.\r\n\r\nThe following code is an example of a very basic route.\r\n\r\nRoute paths, in combination with a request method, define the endpoints at which requests can be made. Route paths can be strings, string patterns, or regular expressions.\r\n\r\nThe characters ?, +, *, and () are subsets of their regular expression counterparts. The hyphen (-) and the dot (.) are interpreted literally by string-based paths.\r\n\r\nIf you need to use the dollar character ($) in a path string, enclose it escaped within ([ and ]). For example, the path string for requests at “/data/$book”, would be “/data/([\\$])book”.","date":"29.03.2021 | 18:37","edited":true,"editedDate":"29.03.2021 | 22:32"},{"id":"jsq0dh4b3","title":"A Mental Trick","type":"brainstorming","author":"Laura Vanderkam","text":"A few years ago, one of my children became obsessed with roller coasters. He watched video after video to study them from afar. He designed his own in computer games. There was just one problem: He was terrified of actually riding one.\r\n\r\nEventually, he identified the “Sooper Dooper Looper” at Hersheypark as a potential option: It wasn’t too tall or too fast, and had only one inversion. But when we actually went to the park, he started to lose his nerve. I knew he would regret it if he didn’t ride the roller coaster after all that, so I reminded him that in two minutes, the ride would be over. Even if he hated it, it was only two minutes (1:45, to be exact). I told him to picture himself on the other side of those two minutes.\r\n\r\nSo he did, and then he rode the coaster. And when it was over, he was really glad he’d tried it. I, meanwhile, was glad that a trick I use often had worked once again. This skill of picturing our future selves is fundamental for discipline — but it’s also important for happiness, which is just as important.\r\n\r\nHumans are pretty bad at picturing our future selves. Research has found that when we think about them, the brain regions that are activated are similar to those activated when we think about strangers — but not as much to those activated when we think about our current selves.\r\nThis may be one reason that people under-save for retirement. Or why we stay up too late — because, as Jerry Seinfeld once observed, a lack of sleep is “Morning Guy’s problem.” But the same research found that when people could actually see (simulated) pictures of their aged selves, then they made better choices.","date":"29.03.2021 | 22:26","edited":false},{"id":"2edkep8h4","title":"Baseball Puts the Regular Back in Regular Season","type":"sport","author":"Tyler Kepner","text":"It was over as soon as it started, more or less, the strangest little season in the history of baseball. Sixty games were all we got, not even 10 weeks — fewer games than a pro basketball or hockey schedule, fewer weeks than an N.F.L. season.\r\n\r\n“Last year was a sprint, and I don’t know if everybody was prepared to sprint, not only on our team but on other teams as well,” said Dusty Baker, the manager of the Houston Astros. “It’s actually more fun playing 162, because then, let’s see who’s the strongest mentally, physically and as a unit.”\r\n\r\nThe new season, which starts on Thursday with all 30 teams in action, offers more than the usual gauzy promises of blue skies, green grass and the warmth of the sun. Actual human fans, at varying capacity levels, will see the return of baseball as usual: a six-month, everyday companion that should give us a new appreciation of the regular in regular season.\r\n\r\nThe Cubs’ season ended with two home losses in a newly created playoff tier that does not return for 2021. While 16 of the 30 teams qualified for the expanded field last October, this year it will be only 10: three division winners and two wild cards from each league.\r\n\r\nThe league and the players’ union could not agree on extending the expanded playoff arrangement for 2021, despite the clear benefits. The industry will be on edge until the sides agree on a new collective bargaining agreement, with the current one expiring Dec. 1. The sport might change significantly in 2022; traditional league affiliations could be shuffled, and the 162-game schedule — first introduced in 1961 — may be adjusted.\r\n\r\n“There is a lot of history there, and a lot of pride taken by players in playing what they experience as a full season,” Tony Clark, the executive director of the players’ association, said in an interview last week. “This is not to suggest that players aren’t willing to have a conversation about some other structure, both from an alignment standpoint, a how-the-games-are-scheduled standpoint, all the way to the number of games that are scheduled in a season.”\r\n\r\nIn the meantime, the old, familiar rhythms of the game will be a source of comfort for fans, a reminder of the timelessness of a sport that is easier than ever to follow. From an East Coast matinee to a West Coast night game, hours of daily broadcasts — on TV and radio — are as close as your smartphone. While typical basketball and hockey seasons last only 82 games, and football a mere 16, the sheer volume of baseball distinguishes it from the rest.","date":"30.03.2021 | 22:29","edited":true,"editedDate":"30.03.2021 | 22:31"},{"id":"i2g9j9r7e","title":"Ten Ways To Protect Your Child Against Bad Experiences","type":"family","author":"Jennifer Hays-Grudo","text":"Adversity, such as abuse, neglect, and poverty, damages children. But protective experiences can build resilience against adversity and promote positive development.\r\n\r\nWe identified 10 relationships and resources proven to counter the impact of adverse experiences. They have hidden magic that can transform an otherwise miserable childhood. Perhaps a child has been abused and has an alcoholic or depressed parent – or both. Down the street lives a grandmother who provides safe harbor. Maybe a caring teacher or an athletics coach takes the child under her wing. These are just a few of many protective antidotes that can diminish the toxicity of adverse experiences. They mean that a child’s outcomes may turn out to be much better than expected in the face of difficult circumstances.\r\n\r\nThis list of PACEs – Protective and Compensatory Experiences – is based on more than common sense. The impact of such experiences is often identifiable through changes to the brain and in behaviors. For example, experiments with mice graphically demonstrate what can happen when a PACE repairs some of the damage caused by bad early experiences.\r\n\r\nThese pups grow up and act in a depressed manner, and are more likely to be harsh and fail to nurture their own pups. However, when the pups are fostered by non-stressed, nurturing mothers, over time, the epigenetic change driving their abusive behaviors can be reversed.\r\n\r\n“When children experience multiple forms of adversity, the impacts are magnified. Multiple protective experiences may also have a cumulative effect.”\r\n\r\nWe do not yet have data for humans on the epigenetic impact of switching from an adverse to a protective experience. However, infants raised initially in Romanian orphanages who were later fostered in nurturing homes showed developmental benefits that likely mirrored the neurobiological improvements observed in mice.\r\n\r\nOur colleague, David Bard, professor of pediatrics at the University of Oklahoma Health Sciences Center, has demonstrated how positive parenting practices in thousands of U.S. families have buffered children against the impacts of adversity. Activities such as reading to children; ensuring they have routines; and taking them to shops, museums, and playgrounds were associated with better learning in preschool and fewer behavioral problems at school than would otherwise have been expected.\r\n\r\nTop 10 protective and compensatory experiences\r\nFrom research evidence, we have assembled a list of the top 10 types of relationships and resources that provide the PACEs that bolster children against adversity. These are detailed more extensively in our new book, Adverse and Protective Childhood Experiences: A Developmental Perspective.\r\n\r\nReceiving unconditional love: Not only do children need to be nurtured and loved, that love should feel unconditional. This does not mean that children never get in trouble or parents never get mad. The crucial point is that whatever a child does, the parent stays on the child’s side. As an infant, it means that when you cry, you get a response; your parents make eye contact with you and cherish you; and they sing, play, and talk with you. As a child, you can count on your parent’s eyes lighting up when you walk into the room; mom or dad always has your back. And when you grow older, it means that your parent sets limits and explains how things are done. There are many ways to express unconditional love.\r\n\r\nHaving a best friend: Close friendship offers protection from peer rejection, bullying, and victimization. This happens not just because a child has someone to talk to, but because it helps the child learn how to deal with conflict and grow a relationship over time. Children have a sense of being important and they have someone to go to.\r\n\r\nVolunteering in the community: Volunteering helps children learn about the needs of others and gives them the opportunity to see a world outside their own. When they understand that helping is not done out of pity, it allows them to accept help from others when they need it.\r\n\r\nBeing part of a group: Being in a group gives children a sense of belonging outside the family. It allows children and teenagers to learn about themselves in different contexts, and provides opportunities for friendship and leadership. Taking part in school clubs and sports is linked to academic success, psychological well-being, and lower rates of substance abuse.\r\n\r\nHaving a mentor: Having an adult other than a parent who can be trusted and counted on for help and advice helps protect against psychological distress and academic difficulties, and reduces the incidence of high-risk activities. Even if children have exemplary parents, an adult outside the home can be an alternative role model to whom children can aspire and is a reminder that someone else loves them.\r\n\r\nLiving in a clean, safe home with enough food: These primary needs are crucial. Good, regular nutrition is important for brain development and protects against health problems; eating dinner regularly with your family reduces the risk of weight problems. Chaotic, unpredictable home environments are associated with harsh and inconsistent parenting. Children who live in unclean, cluttered homes have worse outcomes than those living in clean, organized homes.\r\n\r\nGetting an education: Just like living in a clean, safe home, the opportunity to learn and be educated in an environment with boundaries and rules also protects children from risk. High-quality early childhood programs make a lasting difference to outcomes for children from low-income families.\r\n\r\nHaving a hobby: Whether it is playing an instrument, dancing, doing judo, reading, or playing chess, any recreational activity helps teach self-discipline and self-regulation, and can provide children and youth with a routine and a sense of mastery, competence, and self-esteem.\r\n\r\nEngaging in physical activity: Being physically active helps children handle the physiological effects of stress on the body, and improves mood and mental health. In so doing, it reduces the likelihood that children will grab a bag of chips or lash out to relieve stress.\r\n\r\nHaving rules and routines: Security comes when children know what to expect and when caregivers enforce clear rules and limits. Children cannot parent themselves; they need high expectations, consistency, and parents’ involvement. In early childhood, this means that parents should establish and enforce bedtime and other routines, redirect children when they misbehave, and as children grow up, explain the effects of their behavior on others.","date":"31.03.2021 | 10:17","edited":true,"editedDate":"31.03.2021 | 10:18"},{"id":"utzrv9285","title":"The benefits of cooking at home","type":"cooking","author":"Jeanne Segal","text":"Whether you live on your own or are a busy parent, finding the time and energy to prepare home-cooked meals can seem like a daunting task. At the end of a hectic day, eating out or ordering in might feel like the quickest, easiest option. But convenience and processed food can take a significant toll on your mood and health.\r\n\r\nConvenience food is typically high in chemical additives, hormones, sugar, salt, unhealthy fat, and calories, all of which can adversely affect your brain and outlook. It can leave you feeling tired, bloated, and irritable, and exacerbate symptoms of depression, stress, and anxiety.\r\n\r\nRestaurants often serve more food than you should eat. Many restaurants serve portions that are two to three times larger than the recommended dietary guidelines. This encourages you to eat more than you would at home, adversely affecting your waistline, blood pressure, and risk of diabetes.\r\n\r\nWhen you prepare your own meals, you have more control over the ingredients. By cooking for yourself, you can ensure that you and your family eat fresh, wholesome meals. This can help you to look and feel healthier, boost your energy, stabilize your weight and mood, and improve your sleep and resilience to stress.\r\n\r\nCooking at home doesn’t have to be complicated. The cornerstone of a healthy diet is to eat food that is as close as possible to the way nature made it. That means replacing processed food with real food whenever possible and eating plenty of vegetables and healthy sources of protein. It doesn’t mean you have to spend hours in the kitchen combining hundreds of different ingredients or slavishly following elaborate recipes. In fact, simple meals are often the tastiest.\r\n\r\nCooking at home can even take less time that eating out. There are plenty of quick, simple, and wholesome meals you can cook at home in less time than it takes to travel to a restaurant or wait for a delivery.\r\n\r\nCooking at home is also a great way to spend time with others—and you don’t have to be an accomplished chef. Whatever your abilities or experience as a cook, you can learn to prepare quick and healthy meals that can have real benefits for your mental and physical health.\r\n\r\nFood brings people together and cooking at home is a great way to unite your family over the dining table. Everyone loves a home-cooked meal—even moody teenagers or picky eaters. And if you live alone, that doesn’t mean you have to cook or eat alone. Sharing meals with others is a great way to expand your social network. Getting appreciative feedback on a meal you’ve prepared for someone can bring a real boost to your self-esteem, too.\r\n\r\nMake mealtimes a social experience. The simple act of talking to a friend or loved over the dinner table can play a big role in relieving stress and boosting mood. Gather the family together and stay up to date with each other’s daily lives. If you live alone, invite a friend, coworker, or neighbor over.\r\n\r\nSwitch off screens. Take a break from the TV, turn off your phone, and avoid other distractions so you have a real chance to connect with the person you’re sharing a meal with. By avoiding screens and eating with others, you’ll also help to avoid mindless overeating.\r\n\r\nCook with others. Invite your spouse, roommate, or a friend to share shopping and cooking responsibilities—one prepares the entrée, the other dessert, for example. Cooking with others can be a fun way to deepen relationships and splitting the costs can make it cheaper for both of you.","date":"31.03.2021 | 12:44","edited":false},{"id":"4yrm22868","title":"Stopping Schizophrenia Before It Starts","type":"science","author":"Robert Kolker","text":"One night in the early 1960s, when he was about 17, a high school football star and all-state wrestler named Donald Galvin smashed 10 dishes to pieces — all at once, while standing in front of the kitchen sink.\r\n\r\nHis father wrote it off. So did his mother. Donald was a teenager, moody. It was the ’60s. Other kids were doing worse.\r\n\r\nBut Donald knew there was something wrong. He’d known for a while. He knew that being a star on the football field and having a friendship with another person were two very different things. Sometimes, he would say later, he thought of people as kind of like IBM cards he sorted through his own computer for information he could use. He knew that made him unusual. Increasingly often, he seemed completely oblivious — a stranger to his own motivations and actions. Something was happening, and he couldn’t figure out what. More than anything else, he was afraid.\r\n\r\nAlmost a decade later, in June 1970, a few weeks shy of his 25th birthday, Donald Galvin was arrested by police after trying to harm not just himself but his young wife. He was held in a city jail before being transferred to a state mental hospital. He’d be in and out of that hospital dozens of times in the decades to come, his illness managed with medications.","date":"31.03.2021 | 22:27","edited":false}]